#ifndef ITEMSSTORAGE_H
#define ITEMSSTORAGE_H

#include "structures.h"

#include <QVector>
#include <QFile>


/**
 * @class ItemsStorage
 * @brief Класс для управления и хранения объектов типа FixedItem и его наследников.
 *
 * Этот класс предоставляет методы для добавления, удаления и сортировки элементов,
 * а также для установки приоритетов создания и вычислений. Управляет контейнером элементов,
 * защищённым мьютексом для безопасного доступа из разных потоков, но это пока не используется
 */
class ItemsStorage
{
public:
    /**
     * @brief Конструктор класса ItemsStorage.
     *
     * Резервирует динамическую память для хранения до 20 элементов.
     */
    ItemsStorage();

    /**
     * @brief Деструктор класса ItemsStorage.
     *
     * Удаляет все элементы из контейнера при завершении работы.
     */
    ~ItemsStorage();

    /**
     * @brief Сохраняет новый элемент в контейнер.
     * @param NewItem Указатель на новый элемент типа FixedItem.
     */
    void SaveItem(FixedItem* NewItem);

    /**
     * @brief Удаляет элемент из контейнера по имени.
     *
     * Ищет элемент по имени и удаляет его из контейнера, освобождая память.
     * @param Name Имя элемента для удаления.
     */
    void DeleteItem(QString Name);

    /**
     * @brief Возвращает указатель на элемент по имени.
     *
     * Если элемент с заданным именем найден, возвращает указатель на него,
     * иначе выводит сообщение об ошибке.
     * @param name Имя искомого элемента.
     * @return Указатель на элемент типа FixedItem, либо nullptr, если элемент не найден.
     */
    FixedItem* getItem(QString name);

    /**
     * @brief Устанавливает для всех объектов элемент, который становится базой для рассчета координат для других объектов.
     *
     * Выбирает первый найденный элемент с хорошим соединением в качестве
     * основного элемента для вычислений и назначает его другим элементам.
     * @param ItemsVault Вектор с элементами для обработки.
     */
    void setItemForCalculation(QVector<QPointer<FixedItem>> ItemsVault);
    void setItemForCalculation();

    /**
     * @brief Сортирует элементы по приоритету вычислений.
     *
     * Устанавливает приоритеты вычислений, основываясь на
     * наличии соединения и типе.
     */
    void sortItemsByCalcPriority();

    /**
     * @brief Устанавливает приоритеты создания элементов.
     *
     * Устанавливает приоритеты создания элементов, разделяя их на группы
     * по классу и соединению. Сначала создаются элементы с низким приоритетом.
     * @param ItemsVault Вектор с элементами для обработки.
     */
    static void setItemsCreationIndex(QVector<QPointer<FixedItem>> &ItemsVault);

    void deleteAllItems();

    QVector<QPointer<FixedItem>> ItemsVault; ///< Контейнер для хранения элементов типа FixedItem.

};

#endif // ITEMSSTORAGE_H
